---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.CanInsertRow(System.Int32)
source: html/5d69139e-f243-2093-b539-e63f6f36dd13.htm
---
# Autodesk.Revit.DB.TableSectionData.CanInsertRow Method

Verifies if a new row can be inserted at the given index.

## Syntax (C#)
```csharp
public bool CanInsertRow(
	int nIndex
)
```

## Parameters
- **nIndex** (`System.Int32`)

## Returns
True if the row can be inserted, false otherwise.